const autos = [
  {
    id: 1,
    model: 'Honda Fit',
    img: '/img/main/popular/desktop/1x/desk-honda.webp',
    photos: [],
    year: 2017,
    BodyType: 'Внедорожник', // tip kuzova
    color: 'Белый',
    manufacturer: 'Mazda',
    wheel: 'Левый', //
    mileage: 40000,
    drive: '4WD', //Задний, Полный
    engine: 'Бензиновый',
    vehicleType: 1.5, // fuelType
    power: 'л.с.',
    tx: 'Автомат', // КПП
    auction: 'KCAA Fukuoka',
    rating: 4,
    auctionDate: '08.07.2021', // todo: fix date
    location: 'Япония',
    status: 'Под заказ',
    sale: 1630000,
    details:
      'Внешний вид нового Mazda CX-3 2017 действительно не дотягивает до полноразмерного кроссовера. Небольшой кузов, невысокая посадка и компактные формы. По внешнему виду дизайнеры попытались создать новый автомобиль, но при этом сохранив современные и узнаваемые черты компании Mazda.\nПереднюю часть кроссовера Mazda CX-3 2017 занимает хорошо узнаваемая решетка радиатора, с зауженной часть внизу. В зависимости от комплектации решетка с горизонтальными планками может быть черной или хромированной, но в любом варианте с хромированной окантовкой. Центр решетки радиатора занимает необычная эмблема компании, в нее инженеры вмонтировали переднюю камеру и несколько датчиков.\nПередняя оптика в зависимости от комплектации Mazda CX-3 2017 может быть на основе галогенок. В максимальной комплектации кроссовера установлена светодиодная адаптивная оптика. В любой с комплектаций оптика сделана таким образом, что внутри повторяет часть хромированной окантовки решетки радиатора, тем самым создавая впечатление, что в оптику вмонтировали часть решетки. Нижнюю часть бампера украшает дополнительная решетка радиатора. Боковую часть бампера в зависимости от комплектации будут установлены противотуманки или комплект светодиодных противотуманок со светодиодными дневными ходовыми огнями.',
    reviews: [],
  },
  {
    id: 2,
    model: 'Honda Fit',
    img: '/img/main/popular/desktop/1x/desk-honda.webp',
    photos: [],
    year: 2017,
    BodyType: 'Внедорожник', // tip kuzova
    color: 'Белый',
    manufacturer: 'Mazda',
    wheel: 'Левый', //
    mileage: 40000,
    drive: '4WD', //Задний, Полный
    engine: 'Бензиновый',
    vehicleType: 1.5, // fuelType
    power: 'л.с.',
    tx: 'Автомат', // КПП
    auction: 'KCAA Fukuoka',
    rating: 4,
    auctionDate: '08.07.2021', // todo: fix date
    location: 'Япония',
    status: 'Под заказ',
    sale: 1630000,
    details:
      'Внешний вид нового Mazda CX-3 2017 действительно не дотягивает до полноразмерного кроссовера. Небольшой кузов, невысокая посадка и компактные формы. По внешнему виду дизайнеры попытались создать новый автомобиль, но при этом сохранив современные и узнаваемые черты компании Mazda.\nПереднюю часть кроссовера Mazda CX-3 2017 занимает хорошо узнаваемая решетка радиатора, с зауженной часть внизу. В зависимости от комплектации решетка с горизонтальными планками может быть черной или хромированной, но в любом варианте с хромированной окантовкой. Центр решетки радиатора занимает необычная эмблема компании, в нее инженеры вмонтировали переднюю камеру и несколько датчиков.\nПередняя оптика в зависимости от комплектации Mazda CX-3 2017 может быть на основе галогенок. В максимальной комплектации кроссовера установлена светодиодная адаптивная оптика. В любой с комплектаций оптика сделана таким образом, что внутри повторяет часть хромированной окантовки решетки радиатора, тем самым создавая впечатление, что в оптику вмонтировали часть решетки. Нижнюю часть бампера украшает дополнительная решетка радиатора. Боковую часть бампера в зависимости от комплектации будут установлены противотуманки или комплект светодиодных противотуманок со светодиодными дневными ходовыми огнями.',
    reviews: [],
  },
  {
    id: 3,
    model: 'Honda Fit',
    img: '/img/main/popular/desktop/1x/desk-honda.webp',
    photos: [],
    year: 2017,
    BodyType: 'Внедорожник', // tip kuzova
    color: 'Белый',
    manufacturer: 'Mazda',
    wheel: 'Левый', //
    mileage: 40000,
    drive: '4WD', //Задний, Полный
    engine: 'Бензиновый',
    vehicleType: 1.5, // fuelType
    power: 'л.с.',
    tx: 'Автомат', // КПП
    auction: 'KCAA Fukuoka',
    rating: 4,
    auctionDate: '08.07.2021', // todo: fix date
    location: 'Япония',
    status: 'Под заказ',
    sale: 1630000,
    details:
      'Внешний вид нового Mazda CX-3 2017 действительно не дотягивает до полноразмерного кроссовера. Небольшой кузов, невысокая посадка и компактные формы. По внешнему виду дизайнеры попытались создать новый автомобиль, но при этом сохранив современные и узнаваемые черты компании Mazda.\nПереднюю часть кроссовера Mazda CX-3 2017 занимает хорошо узнаваемая решетка радиатора, с зауженной часть внизу. В зависимости от комплектации решетка с горизонтальными планками может быть черной или хромированной, но в любом варианте с хромированной окантовкой. Центр решетки радиатора занимает необычная эмблема компании, в нее инженеры вмонтировали переднюю камеру и несколько датчиков.\nПередняя оптика в зависимости от комплектации Mazda CX-3 2017 может быть на основе галогенок. В максимальной комплектации кроссовера установлена светодиодная адаптивная оптика. В любой с комплектаций оптика сделана таким образом, что внутри повторяет часть хромированной окантовки решетки радиатора, тем самым создавая впечатление, что в оптику вмонтировали часть решетки. Нижнюю часть бампера украшает дополнительная решетка радиатора. Боковую часть бампера в зависимости от комплектации будут установлены противотуманки или комплект светодиодных противотуманок со светодиодными дневными ходовыми огнями.',
    reviews: [],
  },
];

const testimonials = [
  {
    id: 1,
    author: 'Генадий Сергеевич',
    rate: 5,
    car: 'Toyota Allion',
    url: '',
    prev: '',
  },
  {
    id: 2,
    author: 'Ольга Архипова',
    rate: 4,
    car: 'Toyota Allion',
    url: '',
    prev: '',
  },
  {
    id: 3,
    author: 'Николай Евгеньевич',
    rate: 5,
    car: 'Toyota Allion',
    url: '',
    prev: '',
  },
  {
    id: 4,
    author: 'Роман Юрьевич',
    rate: 5,
    car: 'Toyota Allion',
    url: '',
    prev: '',
  },
];

const reviews = [
  {
    id: 1,
    url: '',
    prev: '/img/main/reviews/desktop/x1/Rectangle%208.png',
    title: 'Космический Shuttle | HONDA FIT SHUTTLE 2013',
    views: 391,
    ago: '3 недели назад',
  },
  {
    id: 1,
    url: '',
    prev: '/img/main/reviews/desktop/x1/Rectangle%208.png',
    title: 'Компактный минивен I Toyota Siena 2017 г.',
    views: 391,
    ago: '3 недели назад',
  },
  {
    id: 1,
    url: '',
    prev: '/img/main/reviews/desktop/x1/Rectangle%208.png',
    title: 'Спецтехника по-крупному | KATO KB1500R',
    views: 391,
    ago: '3 недели назад',
  },
];

const statuses = ['В наличии', 'Под заказ'];

let PER_PAGE = 3;

export function getCars(req = '', page = 1, per_page = PER_PAGE) {
  return autos;
}

export function getTestimonials(car = '') {
  return testimonials;
}

export function getReviews(car = '') {
  return reviews;
}
